# OffsetFromReferenceBase Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..OffsetFromReferenceBase Property
ParameterTypeId Class See Also
---
"Offset from Reference Base"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId OffsetFromReferenceBase { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property OffsetFromReferenceBase As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ OffsetFromReferenceBase {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace